Revit 2027 API
TriOrQuadFacet.NumberOfVertices Property
 The number of vertices (3 for a triangle, 4 for a quadrilateral, 0 for an unset TriOrQuadFacet).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int NumberOfVertices { get; }
Public ReadOnly Property NumberOfVertices As Integer
	Get
public:
property int NumberOfVertices {
	int get ();
}
member NumberOfVertices : int with get
Property Value
Int32
See Also
Reference
TriOrQuadFacet Class
Autodesk.Revit.DB Namespace